Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Pressing the same shortcut after you have invoked Smart-type Completion will search for chained expressions which have expected type.
zh_cn: 调用智能类型补全后，按下相同的快捷方式，将搜索具有预期类型的链式表达式。

source: Prev Parameter
zh_cn: 上一个参数

source: Prev_ious Method
zh_cn: 上一方法(_I)

source: Previ_ous Occurrence
zh_cn: 上一个匹配项(_O)

source: Preview File in
zh_cn: 预览文件在

source: Preview File in...
zh_cn: 预览文件在...

source: Preview {0}
zh_cn: 预览 {0}

source: Previous Ch_ange
zh_cn: 上一个更改(_A)

source: Previous Conflict
zh_cn: 上一个冲突

source: Previous Difference
zh_cn: 上一处差异

source: Previous Entry in Console History
zh_cn: 控制台历史中的上一项输入

source: Previous Error/Warning
zh_cn: 上一错误/警告

source: Previous Failed Test
zh_cn: 上一个失败的测试

source: Previous Frame
zh_cn: 上一帧

source: Previous Message
zh_cn: 上一条信息

source: Previous Method Overload
zh_cn: 上一个方法重载

source: Previous Occurrence
zh_cn: 上一个匹配项

source: Previous Project Window
zh_cn: 上一个项目窗口

source: Previous Search Results
zh_cn: 上一个搜索结果

source: Previous Started Configuration
zh_cn: 前一个启动的配置

source: Previous TODO
zh_cn: 上一页 TODO

source: Previous Template Variable
zh_cn: 上一个模板变量

source: Previous entry in console history
zh_cn: 控制台历史中的上一项输入

source: Previous version ({0})
zh_cn: 以前的版本({0})

source: Pri&vate
zh_cn: 私有(&V)

source: Primary direction for mixed LTR/RTL text
zh_cn: 混合 LTR/RTL 文本的主要方向

source: Primary font:
zh_cn: 主要字体:

source: Primitive type members cannot be annotated
zh_cn: 原始类型的成员不能被注解

source: Print
zh_cn: 打印

source: Print Graph
zh_cn: 打印图表

source: Print Options
zh_cn: 打印选项

source: Print Preview
zh_cn: 打印预览

source: Print as graphics
zh_cn: 作为图形打印

source: Print file
zh_cn: 打印文件

source: Print/Export Actions
zh_cn: 打印/导出操作

source: Printing {0}.
zh_cn: 打印中 {0}.

source: Printing...
zh_cn: 正在打印...

source: Prints a formatted string to System.out
zh_cn: 打印一个格式化字符串到 System.out

source: Prints a string to System.err
zh_cn: 打印一个字符串到 System.err

source: Prints a string to System.out
zh_cn: 打印一个字符串到 System.out

source: Prints a value to System.out
zh_cn: 打印一个值 System.out

source: Prints current class and method names to System.out
zh_cn: 打印当前的类名和方法名到 System.out

source: Prints method parameter names and values to System.out
zh_cn: 打印方法参数的名称和值到 System.out

source: Private constructor ''{0}'' is never used
zh_cn: private 构造函数 ''{0}'' 从未使用

source: Private field ''{0}'' is assigned but never accessed
zh_cn: private 字段 ''{0}'' 被赋值但从未访问

source: Private field ''{0}'' is never assigned
zh_cn: private 字段 ''{0}'' 从未赋值

source: Private field ''{0}'' is never used
zh_cn: private 字段 ''{0}'' 从未使用

source: Private inner class ''{0}'' is never used
zh_cn: private 内部类 ''{0}'' 从未使用

source: Private inner interface ''{0}'' is never used
zh_cn: private 内部接口 ''{0}'' 从未使用

source: Private method ''{0}'' is never used
zh_cn: private 方法 ''{0}'' 从未使用

source: Pro&ject
zh_cn: 项目(&J)

source: Pro&tected
zh_cn: 受保护(&T)

source: Probable bugs
zh_cn: 可能的错误

source: Probably SDK installed in ''{0}'' is corrupt
zh_cn: 可能在 ''{0}'' 中安装的 SDK 已损坏

source: Probably missing doctype.
zh_cn: 也许缺少文档类型。

source: Problem accessing VCS: {0}
zh_cn: 访问 VCS 时遇到问题：{0}

source: Problem processing VM event: Breakpoint: ''{0}'' Error: {1} Would you like to stop at the breakpoint?
zh_cn: 处理虚拟机事件中的问题: 断点:''{0}'' 错误: {1} 你想在断点处停止吗?

source: Problem resolution
zh_cn: 解决问题

source: Problem synopsis
zh_cn: 问题摘要

source: Problem with License Server Response
zh_cn: 许可证服务器响应问题

source: Problematic whitespace
zh_cn: 有问题的空白

source: Problems
zh_cn: 问题

source: Problems Detected
zh_cn: 检测到问题

source: Problems found loading plugins:<p/>
zh_cn: 发现加载插件的问题:<p/>

source: Problems while loading file history
zh_cn: 加载文件历史发生问题

source: Proceed with conversion?
zh_cn: 继续转换？

source: Proceed with project closing?
zh_cn: 继续进行项目关闭？

source: Proceed?
zh_cn: 继续？

source: Proceeding would result in conversion to lambda expression
zh_cn: 继续进行将导致转换为 lambda 表达式

source: Process ''{0}'' Is Running
zh_cn: 进程 ''{0}'' 正在运行

source: Process Duplicate {0} of {1}
zh_cn: 处理重复 {0} / {1}

source: Process Method {2} Duplicate ({0} of {1})
zh_cn: 处理方法 {2} 的重复 ({0} / {1})

source: Process _Annotations
zh_cn: 处理注解(_A)

source: Process all other (writeable) files?
zh_cn: 处理所有其他(可写)文件？

source: Process finished with exit code {0}
zh_cn: 进程完成，退出码 {0}

source: Process resumed
zh_cn: 进程继续

source: Process started
zh_cn: 进程已启动

source: Process terminated
zh_cn: 进程已终止

source: Process terminated with exit code {0}
zh_cn: 进程以退出代码 {0} 终止

source: Process {0} _Annotations
zh_cn: 处理 {0} 注释(_A)

source: Processing classes for emulated method breakpoints
zh_cn: 处理模拟方法断点的类

source: Processing duplicate property key: {0}
zh_cn: 处理重复的属性键:{0}

source: Processing duplicate property key:{0}
zh_cn: 处理重复的属性键:{0}

source: Processing duplicate property value: {0}
zh_cn: 处理重复的属性值:{0}

source: Processing external usages of
zh_cn: 处理外部使用

source: Processing instruction name expected
zh_cn: 期望处理指令名称

source: Processing instruction not terminated
zh_cn: 处理指令未终止

source: Processing left revision...
zh_cn: 处理左修订版本...

source: Processing module "{0}" content...
zh_cn: 处理模块 "{0}" 内容...

source: Processing module "{0}" library classes...
zh_cn: 处理模块 "{0}" 库类...

source: Processing module "{0}" library sources...
zh_cn: 处理模块 "{0}" 库源码...

source: Processing module "{0}" sources...
zh_cn: 处理模块 "{0}" 源码...

source: Processing module ''{0}'' cycles
zh_cn: 处理模块 ''{0}'' 循环

source: Processing project usages in
zh_cn: 处理项目用法在

source: Processing revisions...
zh_cn: 处理修订版本...

source: Processing right revision...
zh_cn: 处理右修订版本...

source: Processing {0}
zh_cn: 处理 {0}

source: Processing...
zh_cn: 处理中...

source: Produce &wildcard types
zh_cn: 生成通配符类型(&W)

source: Production
zh_cn: 产品

source: Production Classes
zh_cn: 生产类

source: Productivity Features Guide
zh_cn: 生产力功能指南

source: Productivity Guide
zh_cn: 生产力指南

source: Productivity hints
zh_cn: 生产率提示

source: Profiles Scopes
zh_cn: 配置文件范围

source: Program a&rguments:
zh_cn: 程序参数：(&R)

source: Program:
zh_cn: 程序:

source: Project Code Style
zh_cn: 项目 代码样式

source: Project &location:
zh_cn: 项目位置:(&L)

source: Project ''{0}''
zh_cn: 项目 ''{0}''

source: Project Conversion Problems
zh_cn: 项目转换问题

source: Project Directory
zh_cn: 项目目录

source: Project Executable
zh_cn: 项目可执行文件

source: Project Files
zh_cn: 项目文件

source: Project Inspection Profile Assignments
zh_cn: 项目检查配置文件分派

source: Project Is Out Of Date
zh_cn: 项目已过期

source: Project JDK (not specified)
zh_cn: 项目 JDK (未指定)

source: Project JDK ({0})
zh_cn: 项目 JDK ({0})

source: Project JDK not specified
zh_cn: 工程 JDK 没有指定

source: Project Libraries
zh_cn: 项目库

source: Project Library
zh_cn: 项目库

source: Project Opening
zh_cn: 项目打开

source: Project Production Files
zh_cn: 项目生产文件

source: Project Profile
zh_cn: 项目配置文件

source: Project Profiles
zh_cn: 项目配置文件

source: Project Profiles Settings
zh_cn: 项目配置文件设置

source: Project SDK
zh_cn: 项目 SDK

source: Project SDK is not defined
zh_cn: 项目 SDK 没有定义

source: Project SDK:
zh_cn: 项目 SDK:

source: Project Settings [{0}]
zh_cn: 项目设置[{0}]

source: Project Structure
zh_cn: 项目结构

source: Project Structure...
zh_cn: 项目结构...

source: Project Test Files
zh_cn: 项目测试文件

source: Project View
zh_cn: 项目视图

source: Project View Actions
zh_cn: 项目视图操作

source: Project View Popup Menu
zh_cn: 项目视图弹出菜单

source: Project View Popup Menu Modify Group
zh_cn: 项目视图弹出菜单修改组

source: Project View Popup Menu Run Group
zh_cn: 项目视图弹出菜单运行组

source: Project View Popup Menu Settings Group
zh_cn: 项目视图弹出菜单设置组

source: Project View Popup Refactoring Group
zh_cn: 项目视图弹出菜单重构组

source: Project and Libraries
zh_cn: 项目和库

source: Project build
zh_cn: 项目构建

source: Project code style settings migration
zh_cn: 项目代码样式设置迁移

source: Project compilation
zh_cn: 项目编译

source: Project default
zh_cn: 项目默认

source: Project directory name must not contain the ''$'' character
zh_cn: 项目目录名不能包含 ''$'' 字符

source: Project file is corrupted
zh_cn: 项目文件已损坏

source: Project files ({0}) or project directories (.idea)
zh_cn: 项目文件 ({0}) 或项目目录 (.idea)

source: Project files cannot be watched (are they under network mount?)
zh_cn: 无法观察项目文件(它们在网络挂载下吗？)

source: Project has an older format and will be converted.
zh_cn: 项目具有较旧的格式，将被转换。

source: Project has no JDK
zh_cn: 项目没有 JDK

source: Project has no JDK configured.
zh_cn: 项目没有 JDK 配置。

source: Project may reload incorrectly.
zh_cn: 项目可能未正确重加载。

source: Project n&ame:
zh_cn: 项目名：(&A)

source: Project name can't be empty
zh_cn: 项目名称不能为空

source: Project open
zh_cn: 项目打开

source: Project opening
zh_cn: 项目打开

source: Project source path
zh_cn: 项目源路径

source: Project views
zh_cn: 项目视图

source: Project was succesfully converted.
zh_cn: 项目成功转换。

source: Project will be reloaded.
zh_cn: 项目将重新加载。

source: Project {0, choice, 1#Library|2#Libraries}
zh_cn: 项目库

source: Project's classpath
zh_cn: 项目的类路径

source: Project's sourcepath
zh_cn: 项目的源路径

source: Project: {0}
zh_cn: 项目: {0}

source: Prologue
zh_cn: 序言

source: Propa&gate Parameters...
zh_cn: 传播参数...(&G)

source: Propagate E&xceptions...
zh_cn: 传播异常...(&X)

source: Properties
zh_cn: 属性

source: Properties Files
zh_cn: 属性文件

source: Property
zh_cn: 属性

source: Property &Key:
zh_cn: 属性键:(&K)

source: Property &Value:
zh_cn: 属性值:(&V)

source: Property ''{0}'' already exists in the file ''{1}''.
zh_cn: 文件 ''{1}'' 中已存在属性 ''{0}''。

source: Property ''{0}'' expected {1} {1, choice, 1#parameter|2#parameters}, passed {2}
zh_cn: 属性 ''{0}'' 期望 {1} {1, choice, 1#个参数|2#个参数}, 传了 {2}

source: Property ''{0}'' is unknown
zh_cn: 属性 ''{0}'' 未知

source: Property Already Exists
zh_cn: 属性已经存在

source: Property Info
zh_cn: 属性信息

source: Property inherited from the ''{0}'' file with the same value
zh_cn: 属性从 ''{0}'' 文件继承，具有相同的值

source: Protanopia (red)
zh_cn: 红色盲(红)

source: Provides service <a href="#javaClass/{0}">{0}</a><br><div style='margin-top: 5px'><font size='2'>Click to navigate</font></div>
zh_cn: 提供服务 <a href="#javaClass/{0}">{0}</a><br><div style='margin-top: 5px'><font size='2'>点击浏览</font></div>

source: Proxy &authentication
zh_cn: 代理验证(&A)

source: Proxy should be set in Settings | HTTP Proxy<br>This JVM property is old and its usage is not recommended by Oracle.<br>(Note: It could have been assigned by some code dynamically.)
zh_cn: 代理应“设置| HTTP 代理”中设置<br>该 JVM 属性已过旧，不被 Oracle 推荐使用。<br>(注意：它可能由一些代码动态设置。)

source: Pu&blic
zh_cn: 公共(&B)

source: Pu_ll Members Up...
zh_cn: 向父类移动成员...(_L)

source: Pu_sh Members Down...
zh_cn: 向子类移动成员...(_S)

source: Pull Members Up
zh_cn: 向父类移动成员

source: Pull class members to superclass or implemented interface
zh_cn: 将类成员拉到超类或实现接口

source: Pulling members up from {0}
zh_cn: 从 {0} 向上移动成员

source: Push Members Down
zh_cn: 向子类移动成员

source: Push class members down to directly inheriting subclasses
zh_cn: 将类成员推送到直接继承子类

source: Push down members from {0}
zh_cn: 从 {0} 下推成员

source: Push members from {0} down
zh_cn: 从 {0} 下推成员

source: Pushed members will not be visible from certain call sites
zh_cn: 推动会员将从某些调用点不可见

source: Pushing members down will result in them being deleted.
zh_cn: 将成员下推会导致它们被删除。

source: Put Label
zh_cn: 贴标签

source: Put _Label...
zh_cn: 贴标签...(_L)

source: Put a result of the selected expression into a field
zh_cn: 将选中表达式的结果放入字段中

source: Put a result of the selected expression into a variable
zh_cn: 将选中表达式的结果放入变量中

source: Put a stack trace or a complete thread dump here:
zh_cn: 把一个堆栈跟踪或一个完整的线程堆转储放到这里:

source: PyCharm allows configuring Python interpreters on the various stages of development:
zh_cn: PyCharm 允许在开发的各个阶段配置 Python 解释器：

source: PyCharm keeps track of which of its features you are using and will offer you some tips to let you know about the features you may have missed.
zh_cn: PyCharm 跟踪了你正使用的一些功能，并给你一些提示以让你知道你可能错过的功能。

source: Qualified new of static class
zh_cn: 静态类的 qualified new

source: Qualifier must be an expression
zh_cn: 限定词必须是表达式

source: Quarantine Cleaner
zh_cn: 隔离清理

source: Quarantined Folder Detected
zh_cn: 检测到隔离文件夹

source: Question
zh_cn: 问题

source: Quic_k Definition
zh_cn: 快速定义(_K)

source: Quick Definition in lookup lists
zh_cn: 在查阅列表中的快速定义

source: Quick Definition lookup
zh_cn: 快速定义查找

source: Quick Documentation in goto class or symbol
zh_cn: 在转到类或符号时的快速文档

source: Quick Documentation in lookups
zh_cn: 在查阅列表中的快速文档

source: Quick Documentation popup
zh_cn: 快速文档弹窗

source: Quick Lists
zh_cn: 快速列表

source: Quick Start
zh_cn: 快速开始

source: Quick _Documentation
zh_cn: 快捷文档(_D)

source: Quick lists
zh_cn: 快速列表

source: Quick switch scheme...
zh_cn: 快速切换方案...

source: Quickly navigate to a class by name
zh_cn: 通过名字快速导航到一个类

source: Quickly navigate to a file by name
zh_cn: 通过名字快速导航到一个文件

source: Quickly navigate to a type by name
zh_cn: 通过名字快速导航到一个类

source: Quickly navigate to a {0} by name
zh_cn: 按名称快速导航到 {0}

source: Quickly navigate to action by name
zh_cn: 通过名字快速导航到操作

source: Quickly navigate to any symbol by name
zh_cn: 通过名字快速导航到某个符号

source: Quickly navigate to changed file by name
zh_cn: 快速导航到更改的文件

source: Quit IDE
zh_cn: 退出 IDE

source: Quote expected
zh_cn: 期望引用

source: R&emove
zh_cn: 移除(&E)

source: R&ename original class and use {0} where possible
zh_cn: 重命名原始类并在可能的地方使用 {0}(&E)

source: R&eplace with local variable
zh_cn: 用局部变量替换(&E)

source: R&un
zh_cn: 运行(&U)

source: RMI Compiler
zh_cn: RMI 编译器

source: ROOT GROUP
zh_cn: 根组

source: RUNNING
zh_cn: 运行中

source: R_ebuild
zh_cn: 重新构建(_E)

source: R_ecent Changes
zh_cn: 最近的更改(_E)

source: R_ecent Find Usages
zh_cn: 最近查找的使用(_E)

source: R_ecompile
zh_cn: 重新编译(_E)

source: R_efresh
zh_cn: 刷新(_E)

source: R_efresh File Status
zh_cn: 刷新文件状态(_E)

source: R_estart
zh_cn: 重启(_E)

source: R_un
zh_cn: 运行(_U)

source: Range Is Too Big
zh_cn: 范围太大

source: Range specified is too big.
zh_cn: 指定范围过大。

source: Rating
zh_cn: 评分

source: Ratio:
zh_cn: 比例:

source: Raw type can be generic
zh_cn: 原始类型可以是通用的

source: Rcomment code
zh_cn: 注释代码

source: Rcreate view from controller
zh_cn: 从控制器创建视图

source: Re&gex
zh_cn: 正则表达式(&G)

source: Re&gular expression
zh_cn: 正则表达式(&G)

source: Re&move
zh_cn: 移除(&M)

source: Re&move silently
zh_cn: 静默移除(&M)

source: Re&view
zh_cn: 回顾(&V)

source: Reachable.
zh_cn: 可到达的。

source: Read-only
zh_cn: 只读

source: Read-only Files Found
zh_cn: 找到只读文件

source: Read-only scheme cannot be modified.
zh_cn: 只读方案不能被修改。

source: Read-only scheme, copy to edit
zh_cn: 只读方案，复制来编辑

source: Rearra&nge code
zh_cn: 重新排列代码(&N)

source: Rearrange Code
zh_cn: 重新排列代码

source: Rearrange Code Before Commit
zh_cn: 提交之前重新排列代码

source: Rearrange code
zh_cn: 重新排列代码

source: Rearranging code...
zh_cn: 重新排列代码...

source: Reason: {1}
zh_cn: 原因：{1}

source: Reason: {2}.
zh_cn: 原因：{2}。

source: Rebuild
zh_cn: 重建

source: Rece_nt Files
zh_cn: 最近的文件(_N)

source: Receiver parameters
zh_cn: 接收参数

source: Receivers are not allowed outside of method parameter list
zh_cn: 接收器不允许在方法参数列表之外

source: Recent
zh_cn: 最近的

source: Recent Changes
zh_cn: 最近的更改

source: Recent Files
zh_cn: 最近的文件

source: Recent Find Usages
zh_cn: 最近查找的使用

source: Recent Tests
zh_cn: 最近的测试

source: Recent changes
zh_cn: 最近的更改

source: Recent changes can be reverted even if you don't use a VCS.
zh_cn: 即使您不使用 VCS，最近的更改也可以恢复。

source: Recent files limit:
zh_cn: 最近文件限制:

source: Recent files popup
zh_cn: 最近文件弹窗

source: Recent searches history
zh_cn: 最近的搜索历史

source: Recently Changed Files
zh_cn: 最近更改的文件

source: Recognized File Types
zh_cn: 识别的文件类型

source: Recompile all files in the project
zh_cn: 重新编译项目中的所有文件

source: Record code &coverage information
zh_cn: 记录代码覆盖率信息(&C)

source: Recursive
zh_cn: 递归

source: Recursive calls highlighting
zh_cn: 递归调用高亮

source: Recursive constructor invocation
zh_cn: 递归构造函数调用

source: Recursive propagation of exception changes won't be performed
zh_cn: 异常更改的递归传播不会被执行

source: Recursive propagation of parameter changes won't be performed
zh_cn: 参数更改的递归传播不会被执行

source: Recursivel&y
zh_cn: 递归(&Y)

source: Recursively
zh_cn: 递归

source: Recursively included
zh_cn: 递归包含

source: Redo
zh_cn: 重做

source: Redo last undone navigation operation
zh_cn: 恢复上次撤消的导航操作

source: Redo {0}
zh_cn: 重做 {0}

source: Reduce image view
zh_cn: 减小图像视图

source: Redundant ''{0}'' call
zh_cn: 冗余的 ''{0}'' 调用

source: Redundant 'requires' directive in module-info
zh_cn: module-info 中多余的 'requires' 指令

source: Redundant 'requires' statement in module-info
zh_cn: module-info 中冗余的 'requires'

source: Redundant Comparator.comparing
zh_cn: 多余的 Comparator.comparing

source: Redundant array creation
zh_cn: 多余的数组创建

source: Redundant array creation for calling varargs method
zh_cn: 用于调用 varargs 方法的多余数组创建

source: Redundant close
zh_cn: 多余的关闭

source: Redundant closing tag for HTML element
zh_cn: HTML 元素的冗余关闭标签

source: Redundant default attribute value assignment
zh_cn: 多余的默认属性值赋值

source: Redundant directive ''requires {0}''
zh_cn: 多余的指令 ''requires {0}''

source: Redundant statement ''requires {0}''
zh_cn: 冗余的语句 ''requires {0}''

source: Redundant suppression
zh_cn: 多余的抑制

source: Redundant throws clause
zh_cn: 多余的 throws 语句

source: Redundant throws declaration
zh_cn: 多余的 throws 申明

source: Redundant type arguments
zh_cn: 多余的类型参数

source: Redundant type cast
zh_cn: 多余的类型转换

source: Refactoring
zh_cn: 重构

source: Refactoring ''Make inner class of'' is not available in {0}
zh_cn: 在 {0} 中 ''使为...的内部类'' 重构不可用

source: Refactoring Actions (1)
zh_cn: 重构操作(1)

source: Refactoring Actions (2)
zh_cn: 重构操作(2)

source: Refactoring Actions (3)
zh_cn: 重构操作(3)

source: Refactoring Preview
zh_cn: 重构预览

source: Refactoring cannot be performed
zh_cn: 重构无法执行

source: Refactoring is not supported for JSP classes
zh_cn: 重构不支持 JSP 类

source: Refactoring is not supported for local and JSP classes
zh_cn: 本地和 JSP 类不支持重构

source: Refactoring: Properties
zh_cn: 重构：属性

source: Refer to a non-existing target tag in your Ant build file, and &productName; will suggest you to automatically create the corresponding tag.
zh_cn: 在 Ant 构建文件中引用一个不存在的目标标签， &productName; 将会建议你自动创建相应的标签。

source: Refer to a non-existing target tag in your Ant build file, and IntelliJ IDEA will suggest you to automatically create the corresponding tag.
zh_cn: 在 Ant 构建文件中引用一个不存在的目标标签， &productName; 将会建议你自动创建相应的标签。

source: Refer to the Comparison section of online help for details.
zh_cn: 有关详细信息，请参阅在线帮助的比较部分。

source: Reference parameters are not allowed here
zh_cn: 引用参数不允许在这里

source: Reference target constraints
zh_cn: 引用目标约束

source: Reference to ''{0}'' has been copied.
zh_cn: ''{0}'' 的引用已复制。

source: Reference to ''{0}'' is ambiguous, both ''{1}'' and ''{2}'' match
zh_cn: 引用 ''{0}'' 是不明确的，''{1}'' 和 ''{2}'' 都匹配

source: Reference type expected
zh_cn: 预期引用类型

source: Reference with class ''{0}'' provides invalid message pattern ''{1}''
zh_cn: 类 ''{0}'' 的引用提供了无效的消息模式 ''{1}''

source: ReferenceData
zh_cn: 参考数据

source: References found in code
zh_cn: 代码中找到的引用

source: References found in generated code
zh_cn: 生成代码中找到的引用

source: References in code to elements from migration map "{0}" {1}
zh_cn: 来自迁移地图 "{0}" {1} 的元素代码中的引用

source: References in code to {0}
zh_cn: 代码中 {0} 的引用

source: References in code to {0} {1}
zh_cn: 在代码中引用到 {0}{1}

source: References in code {0}
zh_cn: 代码 {0} 中的引用

source: References to ''{0}'' to be replaced with references to ''{1}''
zh_cn: ''{0}'' 的引用，要被替换为的 ''{1}'' 的引用

source: References to be changed {0}
zh_cn: 要更改的引用 {0}

source: References to be inverted {0}
zh_cn: 要反转的引用 {0}

source: References to be modified
zh_cn: 要修改的引用

source: Referring Objects For {0}
zh_cn: {0} 的引用对象

source: Reflective access
zh_cn: 反射访问

source: Reflective access across modules issues
zh_cn: 跨模块反射访问问题

source: Reflective access issues
zh_cn: 反射访问问题

source: Reflective access to nonexistent/not visible class member
zh_cn: 对不存在/不可见类成员的反射访问

source: Reflective invocation arguments mismatch
zh_cn: 反射调用参数不匹配

source: Reformat Block
zh_cn: 重新格式化块

source: Reformat Code
zh_cn: 重新格式化代码

source: Reformat Code Before Commit
zh_cn: 提交前重新格式化代码

source: Reformat Files
zh_cn: 重新格式化文件

source: Reformat and Optimize Imports
zh_cn: 格式化及优化导入

source: Reformat block on typing '}'
zh_cn: 输入 '}' 时重新格式化块

source: Reformat changed text
zh_cn: 重新格式化更改的文本

source: Reformat code
zh_cn: 重新格式化代码

source: Reformat on paste:
zh_cn: 粘贴时重新格式化:

source: Reformat selected files?
zh_cn: 重新格式化所选文件？

source: Reformat string literal or comment to fit maximum width (usually 80)
zh_cn: 重新格式化字符串文字或注释以适应最大宽度(通常为80)

source: Reformatting code...
zh_cn: 重新格式化代码...

source: Reformatting {0}
zh_cn: 重新格式化 {0}

source: Refresh
zh_cn: 刷新

source: Refresh VCS changes
zh_cn: 刷新 VCS 更改

source: Refresh VCS status for all files in project
zh_cn: 刷新所有项目文件的 VCS 状态

source: Refresh failed: {0}
zh_cn: 刷新失败:{0}

source: Refresh file history
zh_cn: 刷新文件历史记录

source: Refresh the file system tree
zh_cn: 刷新文件系统树

source: Refresh the list of committed changes
zh_cn: 刷新提交的更改列表

source: Refresh the list of incoming changes
zh_cn: 刷新改变的列表

source: Refreshing VCS history
zh_cn: 刷新 VCS 历史

source: Refreshing incoming changes
zh_cn: 刷新传入的更改

source: Regex
zh_cn: 正则表达式

source: Register Custom Compiler Taskdefs
zh_cn: 注册自定义的编译器任务定义

source: Register New File Type Association
zh_cn: 注册新文件类型关联

source: Registered Patterns
zh_cn: 已注册的模式

source: Registering Ant Build File ''{0}''...
zh_cn: 注册 Ant 构建文件 ''{0}''...

source: Registry...
zh_cn: 注册...

source: Regular Expressions Help
zh_cn: 正则表达式帮助

source: Regular expression argument expected on ''{0}'' option
zh_cn: 期望在 ''{0}'' 选项的正则表达式参数

source: Regular expression matches empty string
zh_cn: 正则表达式匹配空字符串

source: Regular expression must be defined
zh_cn: 必须定义正则表达式

source: Regular expression to match output:
zh_cn: 匹配输出的正则表达式：

source: Regular expression used in the filter is invalid
zh_cn: 过滤器使用的正则表达式是无效的

source: Regular expressions
zh_cn: 正则表达式

source: Rejected commit: {0}
zh_cn: 被拒绝的提交:{0}

source: Related file
zh_cn: 相关文件

source: Relational operators (<, >, <=, >=)
zh_cn: 关系运算符 (<, >, <=, >=)

source: Relative path to sources is empty.
zh_cn: 源的相对路径是空的。

source: Relo_ad Changed Classes
zh_cn: 重新加载已更改的类(_A)

source: Reload
zh_cn: 重新加载

source: Reload "{0}" from disk and lose all changes?
zh_cn: 从磁盘重新加载 "{0}" 并丢失所有更改？

source: Reload Changed Classes
zh_cn: 重新加载已更改的类

source: Reload Changed Classes for {0}
zh_cn: 重新加载改变的类为 {0}

source: Reload Error
zh_cn: 重新加载错误

source: Reload File
zh_cn: 重新载入文件

source: Reload From Disk
zh_cn: 从磁盘重新加载

source: Reload Project
zh_cn: 重新加载项目

source: Reload all changed classes into application being debugged (HotSwap)
zh_cn: 将所有更改的类重新加载到被调试的应用程序(热切换)

source: Reload changed classes now?
zh_cn: 现在重新加载改变的类？

source: Reload classes after compilation:
zh_cn: 编译后重新加载类：

source: Reload classes in &background
zh_cn: 在后台重新加载类(&B)

source: Reload current file from disk and lose all changes
zh_cn: 从磁盘重新加载当前文件并放弃所有更改

source: Reload from Dis_k
zh_cn: 重新从磁盘加载(_K)

source: Reload from Disk
zh_cn: 重新从磁盘加载

source: Reloading classes with active third-party JVM agents may cause the JVM to hang.
zh_cn: 使用活动的第三方 JVM 代理重新加载类可能导致 JVM 挂起。

source: Reloading classes...
zh_cn: 重新加载类...

source: Remo&ve
zh_cn: 移除(&V)

source: Remote
zh_cn: 远程

source: Remote debug configuration
zh_cn: 远程调试配置

source: Remote desktop detected
zh_cn: 远程桌面检测

source: Remove
zh_cn: 移除

source: Remove "{0}" attribute
zh_cn: 移除 "{0}" 属性

source: Remove &All
zh_cn: 全部移除(&A)

source: Remove ''{0}'' call
zh_cn: 移除 ''{0}'' 调用

source: Remove ''{0}'' from ''{1}'' throws list
zh_cn: 移除 ''{0}'' 从 ''{1}'' 抛出列表

source: Remove ''{0}'' suppression
zh_cn: 移除 ''{0}'' 抑制

source: Remove ''{0}()'' call
zh_cn: 移除 ''{0}()'' 调用

source: Remove ''{0}()'' call and use ''{1}()''
zh_cn: 删除 ''{0}()'' 调用并使用 ''{1}()''

source: Remove 'catch...'
zh_cn: 移除 'catch...'

source: Remove 'else...'
zh_cn: 移除 'else...'

source: Remove <{0}> element
zh_cn: 移除 <{0}> 元素

source: Remove Action
zh_cn: 移除操作

source: Remove All Watches
zh_cn: 移除所有观察点

source: Remove Annotation Class
zh_cn: 移除注解类

source: Remove Build File
zh_cn: 移除构建文件

source: Remove Configuration
zh_cn: 移除配置
